Функция СоздатьИнформационнуюБазу(ИБ,ПолноеИмяШаблонаCfИлиDt = Неопределено) Экспорт
    
    СтрокаПараметров = ПараметрыЗапускаДляСозданияИнформационнойБазы(ИБ,ПолноеИмяШаблонаCfИлиDt);
    Результат = Запуск1С(СтрокаПараметров);
    Возврат Результат;
КонецФункции 

Функция ЗагрузитьCF(ПолноеИмяCF) Экспорт
    
    СтрокаПараметров = "";
    Результат = Запуск1С(СтрокаПараметров);
    Возврат Результат;
КонецФункции 

Функция Запуск1С(СтрокаПараметров) Экспорт
    
    Результат = Запуск.Запуск1С(СтрокаПараметров);
    Возврат Результат;
КонецФункции 

Функция ПараметрыЗапускаДляСозданияИнформационнойБазы(ИБ,ПолноеИмяШаблонаCfИлиDt = Неопределено)
    
    Результат = "";
    
    Возврат Результат;		
КонецФункции

Функция ПараметрыЗапускаДляЗагрузкиCf(ИБ,ПолноеИмяCf = Неопределено)
    
    Результат = "";
    
    Возврат Результат;		
КонецФункции
