Функция Запуск1С(СтрокаПараметров) Экспорт
    
    ИмяЛога = ПолучитьИмяВременногоФайла(".txt");
                                                           
    ПутьК1С = ПараметрыВызовСервера.ПутьКФайлуЗапуска1С();  
    СтрокаПараметров = СтрокаПараметров + " /Out " + ИмяЛога; //"-NoTruncate" - не очищать вывод каждый раз
    
    Результат = ЗапуститьДождатьсяЗавершенияПрочитатьЛоги(ПутьК1С,СтрокаПараметров,ИмяЛога);
    
    Возврат Результат;
КонецФункции 

Функция ЗапуститьДождатьсяЗавершенияПрочитатьЛоги(ПолноеИмяФайлаЗапуска, СтрокаПараметров,ПолноеИмяЛога = Неопределено,КонсольнаяКоманда = Истина) Экспорт
    
    Если ПолноеИмяЛога = Неопределено Тогда
        ПолноеИмяЛога = ПолучитьИмяВременногоФайла(".txt");
    КонецЕсли;
    
    СтрокаКоманды = СтрШаблон("%1 %2",ПолноеИмяФайлаЗапуска, СтрокаПараметров); 
    
    Если ПолноеИмяЛога <> Неопределено Тогда
        СтрокаКоманды = СтрШаблон("%1>%2",СтрокаКоманды, ПолноеИмяЛога); 
    КонецЕсли;
    
    Если КонсольнаяКоманда Тогда                             
        ИмяКонсольногоФайла = ПолучитьИмяВременногоФайла(".cmd");
        ПакетныйФайл = Новый ЗаписьТекста(ИмяКонсольногоФайла,КодировкаТекста.OEM);
        //ПакетныйФайл.ЗаписатьСтроку("chcp 65001"); 
        ПакетныйФайл.ЗаписатьСтроку(СтрокаКоманды); 
        
        Если ПараметрыВызовСервера.ПолучитьРежимОтладки() Тогда
            ПакетныйФайл.ЗаписатьСтроку("pause");
        КонецЕсли;
        
        ПакетныйФайл.Закрыть();
        
        ЗапуститьПриложение(ИмяКонсольногоФайла,КаталогВременныхФайлов(),Истина);
    Иначе
        ЗапуститьПриложение(СтрокаКоманды,,Истина);
    КонецЕсли;
    
    Результат = Логи.ПолучитьТекстФайла(ПолноеИмяЛога);
    Возврат Результат;
КонецФункции

Функция ВыполнитьЗапросMsSql(ИнформационнаяБаза,ТекстЗапроса) Экспорт
    
    СерверMsSql = ИнформационнаяБаза.СерверSQL;
    
    Соединение  = Новый COMОбъект("ADODB.Connection");
    Команда     = Новый COMОбъект("ADODB.Command");
    ConnectionString = СтрШаблон("driver={SQL Server};server=%1;uid=%2;pwd=%3;database=%4;"
    , СерверMsSql.Наименование
    , СерверMsSql.ИмяПользователя
    , СерверMsSql.ПарольПользователя
    , ИнформационнаяБаза.Наименование
    );
    
    Соединение.ConnectionTimeout = 30;
    Соединение.CommandTimeout = 600;
    
    Соединение.Open();
    Команда.ActiveConnection = Соединение;
    
    Попытка
    	Рекордсет = Соединение.Execute(ТекстЗапроса,,128);    
    Исключение
        Сообщить(ОписаниеОшибки());
    КонецПопытки;
    
    Попытка
    	Соединение.Close();
    Исключение
        //ОписаниеОшибки()
    КонецПопытки;
    
    Результат = "";
    Возврат Результат;
КонецФункции 
