Функция УстановленныеВерсииПлатформы1С() Экспорт
    
    //Параметры = "product where ""vendor='1С-Софт' and name like '%%Предприятие 8%%'"" get InstallLocation, Version, Name, Vendor";
    Параметры = "product where ""vendor='1С-Софт' and name like '%%Предприятие 8%%'"" get Name,InstallLocation,Version";
    Вывод = Запуск.ЗапуститьДождатьсяЗавершенияПрочитатьЛоги("wmic",Параметры);
    
    ТЗ = Новый ТаблицаЗначений;
    ТЗ.Колонки.Добавить("Версия",Новый ОписаниеТипов("Строка"),"Версия");
    ТЗ.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка"),"Наименование");
    ТЗ.Колонки.Добавить("ПолныйПуть",Новый ОписаниеТипов("Строка"),"Полный путь");
    
    Для сч = 2 По СтрЧислоСтрок(Вывод) Цикл
        ОписаниеПлатформыСтрокой = СтрПолучитьСтроку(Вывод,сч);
        СтрокаОписания = ТЗ.Добавить();
        
        //ОписаниеПлатформыСтрокой = СтрЗаменить(ОписаниеПлатформыСтрокой,"  ","");
        НачалоНаименования = СтрНайти(ОписаниеПлатформыСтрокой,"1С:Предприятие 8"); //1С на английском
        
        Если НачалоНаименования = 0 Тогда
            НачалоНаименования = СтрНайти(ОписаниеПлатформыСтрокой,"1C:Предприятие 8"); //1С на русском
        КонецЕсли;                                                                    
        НачалоНаименования = НачалоНаименования - 1;
        СтрокаОписания.ПолныйПуть   = СокрЛП(Лев(ОписаниеПлатформыСтрокой,НачалоНаименования));        
        
        СтрокаИсточник = СокрЛП(Сред(ОписаниеПлатформыСтрокой,НачалоНаименования));
        КонецНаименования = СтрНайти(СтрокаИсточник,")  ");
        СтрокаОписания.Наименование = СокрЛП(Лев(СтрокаИсточник,КонецНаименования));        
        
        СтрокаОписания.Версия = СокрЛП(Сред(СтрокаИсточник,КонецНаименования+3));        
    КонецЦикла;
    
    //Результат = СтрРазделить(Вывод," ",Ложь);
    Возврат Новый Структура("ОписаниеТекстом,ОписаниеТЗ",Вывод,ТЗ);
КонецФункции 
